#include <iostream>;
#include <string>;
using namespace std;
int main()
{
	setlocale(LC_ALL, "ru");
	string c[] = { "зеленой", "красной","желтой", "белой" ,"черной", "зеленого", "красного","желтого", "белого" ,"черного" };
	string z[] = { "крысы", "коровы", "тигра", "зайца", "дракона", "змеи", "лошади", "овцы", "обезь€ны", "курицы", "собаки" , "свиньи" };
	int i;
	cout << "¬ведите нужный вам год: ";
	cin >> i;
	cout << i << " год - это год ";
	if ((i - 4) % 12 > 1 and (i - 4) % 12 < 5)
	{
		cout << c[(((i - 4) % 60) / 12)+5] << " " << z[(i - 4) % 12];
	}
	else
	{
		cout << c[((i - 4) % 60) / 12] << " " << z[(i - 4) % 12];
	}
}