#include <iostream>;
#include <string>;
using namespace std;
int main()
{
	setlocale(LC_ALL, "ru");
    string edd1[] = { "первое", "второе", "третье", "четвертое", "пятое", "шестое", "седьмое", "восьмое", "девятое", "десятое",
    "одиннадцатое", "двенадцатое", "тринадцатое", "четырнадцатое", "пятнадцатое", "шестнадцатое", "семнадцатое", "восемнадцатое", "девятнадцатое" };
    string mes[] = { "января","февраля","марта","апреля","мая","июня","июля","августа","сентября","октября","ноября","декабря" };
    cout << "Введите день (число и через пробел номер месяца): ";
    int d, m;
    cin >> d >> m;
    switch (d/10)
    {
    case 0:
        cout << edd1[d - 1];
        break;
    case 1:
        cout << edd1[d - 1];
        break;
    case 2:
        if ((d % 10) == 0) { cout << "двадцатое"; }
        else { cout << "двадцать " << edd1[d % 10 - 1]; }
        break;
    case 3:
        if ((d % 10) == 0) { cout << "тридцатое"; }
        else { cout << "тридцать " << edd1[d % 10 - 1]; }
        break;
    }
    cout << " " << mes[m - 1];
}