#include <iostream>;
#include <string>;
using namespace std;
int main()
{
    setlocale(LC_ALL, "ru");
    int i;
    string edd1[] = { "одно", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять""десять",
    "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать" };
    string d[] = { "двадцать", "тридцать","сорок" };
    cout << "Введите число: ";
    cin >> i;
    switch (i /10)
    {
    case 1:
        cout << edd1[i];
        break;
    case 2:
        if ((i%10) == 0)
        {
            cout << "двадцать";
        }
        else
        {
            cout << d[(i/10)-2] << " " << edd1[(i%10) - 1];
        }
        break;
    case 3:
        if ((i%10) == 0)
        {
            cout << "тридцать";
        }
        else
        {
            cout << d[(i / 10) - 2] << " " << edd1[(i%10) - 1];
        }
        break;
    case 4:
        cout << "сорок";
        break;
    }
    if ((i%10) == 1)
    {
        cout << " учебное задание";
    }
    if (((i % 10) == 2) or ((i % 10) == 3) or ((i % 10) == 4))
    {
        cout << " учебных задания";
    }
    if (((i % 10) > 4) or ((i % 10) == 0))
    {
        cout << " учебных заданий";
    }
}