#include <iostream>;
#include <string>;
using namespace std;
int main()
{
	setlocale(LC_ALL, "ru");
	int i,i1,i2,i3;
	string edd1[] = {"один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять", "десять",
	"одиннадцать","двенадцать","тринадцать","четырнадцать","пятнадцать","шестнадцать","семнадцать","восемнадцать","девятнадцать" };
	string d[] = {"двадцать ","тридцать ","сорок ","пятьдесят ","шестьдесят ","семьдесят ","восемьдесят ","девяносто " };
	string s[] = {"сто ","двести ","триста ","четыреста ","пяитьсот ","шестьсот ","семьсот ","восемьсот ","девятьсот " };
	cout << "Введите число: ";
	cin >> i;
	i1 = (i / 100);
	i2 = (i % 100) / 10;
	i3 = i % 10;
	if (i / 100 > 0) cout << s[i1-1];
	if ((i % 100) >= 20 and (i / 10 > 0)) cout << d[i2-2];
	if((i % 10 > 0) and ((i%100>19) or (i % 100 < 10))) cout << edd1[i3-1];
	if ((i % 100 >= 10) and (i % 100 < 20)) cout << edd1[i3 + 9];
}